advent-of-code-2022.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-17 Sun 23:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Advent of Code 2022</title>
<meta name="author" content="Mark Armstrong" />
<meta name="description" content="My solutions to the AoC 2022 challenge, implemented in Go" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Advent of Code 2022</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org-anchor-Day-1:-Calorie-Counting^1">1. Day 1: Calorie Counting</a>
<ul>
<li><a href="#org-anchor-Part-1^1">1.1. Part 1</a></li>
<li><a href="#org-anchor-Part-1-solution^1">1.2. Part 1 solution</a></li>
</ul>
</li>
</ul>
</div>
</div>

<p>
For the 2022 challenge, I initially solved 14.5 days in Go;
unfortunately, those solutions were never backed up and were lost in a laptop change.
I later revisited the problems in late 2024 as interview preparation.
</p>

<div id="outline-container-org-anchor-Day-1:-Calorie-Counting^1" class="outline-2">
<h2 id="org-anchor-Day-1:-Calorie-Counting^1"><span class="section-number-2">1.</span> Day 1: Calorie Counting</h2>
<div class="outline-text-2" id="text-org-anchor-Day-1:-Calorie-Counting^1">
</div>

<div id="outline-container-org-anchor-Part-1^1" class="outline-3">
<h3 id="org-anchor-Part-1^1"><span class="section-number-3">1.1.</span> Part 1</h3>
<div class="outline-text-3" id="text-org-anchor-Part-1^1">
<p>
Santa's reindeer typically eat regular reindeer food, but they need a lot of magical energy to deliver presents on Christmas. For that, their favorite snack is a special type of star fruit that only grows deep in the jungle. The Elves have brought you on their annual expedition to the grove where the fruit grows.
</p>

<p>
To supply enough magical energy, the expedition needs to retrieve a minimum of fifty stars by December 25th. Although the Elves assure you that the grove has plenty of fruit, you decide to grab any fruit you see along the way, just in case.
</p>

<p>
Collect stars by solving puzzles. Two puzzles will be made available on each day in the Advent calendar; the second puzzle is unlocked when you complete the first. Each puzzle grants one star. Good luck!
</p>

<p>
The jungle must be too overgrown and difficult to navigate in vehicles or access from the air; the Elves' expedition traditionally goes on foot. As your boats approach land, the Elves begin taking inventory of their supplies. One important consideration is food - in particular, the number of Calories each Elf is carrying (your puzzle input).
</p>

<p>
The Elves take turns writing down the number of Calories contained by the various meals, snacks, rations, etc. that they've brought with them, one item per line. Each Elf separates their own inventory from the previous Elf's inventory (if any) by a blank line.
</p>

<p>
For example, suppose the Elves finish writing their items' Calories and end up with the following list:
</p>

<div class="org-src-container">
<pre class="src src-text">1000
2000
3000

4000

5000
6000

7000
8000
9000

10000

</pre>
</div>
<p>
This list represents the Calories of the food carried by five Elves:
</p>

<p>
The first Elf is carrying food with 1000, 2000, and 3000 Calories, a total of 6000 Calories.
The second Elf is carrying one food item with 4000 Calories.
The third Elf is carrying food with 5000 and 6000 Calories, a total of 11000 Calories.
The fourth Elf is carrying food with 7000, 8000, and 9000 Calories, a total of 24000 Calories.
The fifth Elf is carrying one food item with 10000 Calories.
In case the Elves get hungry and need extra snacks, they need to know which Elf to ask: they'd like to know how many Calories are being carried by the Elf carrying the most Calories. In the example above, this is 24000 (carried by the fourth Elf).
</p>

<p>
Find the Elf carrying the most Calories. How many total Calories is that Elf carrying?
</p>
</div>
</div>

<div id="outline-container-org-anchor-Part-1-solution^1" class="outline-3">
<h3 id="org-anchor-Part-1-solution^1"><span class="section-number-3">1.2.</span> Part 1 solution</h3>
<div class="outline-text-3" id="text-org-anchor-Part-1-solution^1">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #b6a0ff;">func</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">()</span> <span style="color: #ffffff;">{</span>
<span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mark Armstrong</p>
     <p class="author">Contact: <a href="mailto:markparmstrong@gmail.com">markparmstrong@gmail.com</a></p>
     <script language=javascript> if ("") { `<p class="date">Original date: </p>` } </script>
     <p class="date">Last updated: 2024-11-17 Sun 23:53</p>
     <p class="creator">Created using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
     <p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
